'use strict';

/**
 * Test setup-options module
 * @module
 * @author Oleg Dutchenko <dutchenko.o.dev@gmail.com>
 * @version 3.0.0
 */

// ----------------------------------------
// Imports
// ----------------------------------------

// modules
const should = require('should'); // eslint-disable-line

// utils
const colors = require('./utils/colors');

// testing module
const testingModule = require('../utils/setup-options');


// ----------------------------------------
// Private
// ----------------------------------------

// в этой части файла создаються и описываються
// вспомогательные значения и методы, который будут использованы
// внутри вашего основного кода, ради которого создан этот файл
// Также слово приватный - обозначает что эти значения и методы
// не будут доступны за пределами этого файла

// ----------------------------------------
// Public
// ----------------------------------------

// Ваш основной код
// Он публичен, соответственно к нему
// должен быть доступ ввиде глобального значения,
// или должен формировать публичное API,
// или должен быть частью публичного API,
// или должен эспортироваться как модуль

// ----------------------------------------
// Exports
// ----------------------------------------

// Если это модуль, он должен экспортировать
// Описаный в нем функционал или данные из текущего файла
